{"current_edition":{"edition":"Volume 26 Issue 5"},"editions":[{"title":"Volume 26 Issue 5","time":"Summer 2017","articles":[{"title":"Features","content":[{"title":"Student Feature: Provisional Patent","author":"SNEHA SHIVAKUMAR","summary":"BRHS boasts a diverse population of students with a menagerie of hobbies and talents; Hasith Bomma, a senior, is one such student who has assumed the role of a part-time innovator and inventor.","article":"BRHS boasts a diverse population of students with a menagerie of hobbies and talents; Hasith Bomma, a senior, is one such student who has assumed the role of a part-time innovator and inventor. His efforts are focused on developing a desalination and clean energy device. The device removes hydrogen from water to be utilized as a clean energy source, while simultaneously desalinating saltwater. Additionally, it is protected by a provisional patent application. Bomma is continuing to experiment, and he intends to file a full application prior to the end of the year, contingent on the completion of a working model. #NEWLINE “I spend a lot of time researching things that interest me, and I really wanted to help solve a major world problem,” he said. He initially began experimenting with a rudimentary scheme during junior year, and was not met with much success. Later that year, however, he began working with the concept of thermoelectrics and was able to successfully incorporate it into his designs. “I started trying to look for new energy sources, and I came across hydrogen fuel and thermoelectrics. I just put the two together -- the new plan happened to solve some water issues as well.” #NEWLINE This discovery was followed by hours of research and reading. “I did most of the work slowly, on my own,” he said. Bomma read various research papers, online articles, and scholarly articles in order to understand the ideas regarding the technology that comprised his project. From October to December alone, and he invested a minimum of two hours daily in order to improve and develop his ideas. He later filed a patent, as suggested by his family, with assistance from the patent office at Rutgers University. #NEWLINE Bomma plans to continue working on inventions at Rutgers University and also after medical school. “I tend to think of my inventions nearly all the time in the back of my head,” he says. “Sometimes ideas just end up clicking and I write them down for later.” He currently is enrolled to major in computer science and work with the Rutgers research team, before pursuing a medical degree and specializing in spinal surgery."}]}]},{"title":"Volume 26 Issue 4","time":"Spring 2017","articles":[{"title":"Front Page","content":[{"title":"BRHS Music takes Indianapolis","author":"Lillian Hsu","summary":"After months of preparation, the BRHS Wind Ensemble (BRWE) and Symphony Orchestra (BRSO) set out for Indianapolis, where the National Music for All Festival was held.","article":"After months of preparation, the BRHS Wind Ensemble (BRWE) and Symphony Orchestra (BRSO) set out for Indianapolis, where the National Music for All Festival was held. This is an annual festival and out of the hundreds of applicants that applied, BRWE and BRSO were chosen to be a part of the festival. The students spent more than twelve hours on a bus overnight with their fellow comrades and arrived on March 9. That same day, BRSO was set to perform. After a rehearsal in the morning, the two ensembles had some down time before a group dinner at Buca di Beppo. At this time, the ensembles welcomed Mr. Lazovick to be apart of the trip. After the dinner, the orchestra prepared for the long-awaited concert and the wind ensemble sat in the audience. BRSO, conducted by Mr. Musacchio, performed last, playing three pieces called Suite for Strings by John Rutter, Washington Speaks by Richard Danielpour, and Finale to Symphony No. 9 in E Minor “From The New World” by Antonin Dvorak. Washington Speaks was especially significant for the performers because Mr. Lazovick was a guest speaker and narrator during the piece, playing the role of George Washington. The evening ended in a standing ovation for the orchestra. The next day, the two ensembles departed for a day filled with clinics, rehearsals, masterclasses and concerts. The orchestra had a clinic with Maestro Larry Livingston (University of Southern California, Los Angeles) and Maestro Franz Krager (University of Houston), in which the ensemble got lots of good feedback and had lots of fun at the same time. That night, the two ensembles got back together and went to listen to the Honor Orchestra of America and the Jazz Band of America. The Honor Orchestra of America featured three BRHS members, violinists Jay Kuo (concertmaster) and Irene Qiao, and violist Caroline Huang. The final day began with an early start for the ensembles, as BRWE was set to perform on the featured stage. In the morning, BRWE, conducted by Dr. Bourgault and Mr. Crowley, gave a powerful performance of six pieces, including March of the Belgian Parachutists by Pierre Leemans, Endurance by Timothy Mahr, This is the Drum by Andrew Boysen, Jr., Toccata Marziale by Ralph Vaughan Williams, Hymn to Yerevan by Alan Hovhaness, and ended the program with Variations on “America” by Charles Ives. BRWE received two standing ovations for their performance and made a lasting impression on those who were there. Following this performance, BRWE had their clinic with Richard L. Floyd (University of Texas, Austin), whom the ensemble has worked with before. The ensemble received lots of helpful feedback and were able to improve their playing. To wind down the trip, the two ensembles had some free time to explore Indianapolis before attending the awards gala, where the two groups were honored along with the other ensembles. For orchestra, seniors Trisha Kaundinya and Ryan Jin accepted the orchestra plaque, and for wind ensemble, seniors Marshall Yuan, Michael Ireland, and Riley Sasse accepted the featured band plaque. The whole festival experience ended with performances by the honor ensembles of America before a long journey back to New Jersey. The weekend was filled with lots of music, feedback, and most importantly, memories. Special thanks to: band directors Dr. Bourgault and Mr. Crowley, orchestra director Mr. Musacchio, Dr. Morrell, Mr. Lazovick, the chaperones, the OPA and BPA, the crew at Music for All, US Courriers, and all the supporters of BRWE and BRSO."}]},{"title":"News","content":[{"title":"T.E.S.T Team 303 Wins","author":"Isobel Ali","summary":"Our robotics team, T.E.S.T. Team 303, has been picking up “steam” since the start of their competitive season.","article":"As “spring” starts to make its way back to New Jersey, we can see the beginnings of every sports season take their own holds over the student athletes. As it happens, BRHS isn’t just flexing its physical muscles, but its brain, too. Our robotics team, T.E.S.T. Team 303, has been picking up “steam” since the start of their competitive season. Starting in January, the 303 Team began their build season with constructing their robot for six weeks, in preparation for this year’s steampunk-themed competition. Over those six weeks, our robotics crew got together to contribute tireless hours of work to fundraising, applications for awards, advertising, and building and training with the robot, so they could be as prepared as possible. When I had the chance to speak with Jamisha Amin, she said, “I have faith in our robot, and I have faith in our team.” And she had every reason to be. Over the weekend of the 11th-12th, our team competed in their opening match against Mt. Olive High School and, while they had a rocky start, 303 managed to pull through to win not only the competition, but to win the prestigious Chairman’s Award as well, securing their position in the championships in this season. The next competition is a Bridgewater MAR district event, which we’re hosting in our big gymnasium The rules are as follows:-During the first fifteen seconds of the match, the robots have to move with the help of pre-programming alone, and when rotors are turned during this fifteen seconds, they are worth sixty points. -When a robot gets a rotor turning at any other time during the game (which is known as the tele-op portion), it’s worth forty points, and when one team manages to get all four of the rotors on an airship (as per the theme) spinning, that team gets a one hundred point bonus. -At the end of each of the qualification matches, if a team is in the top eight teams, that team can choose two other teams as alliance partners; the number one team is allowed to choose these two alliance teams from the top eight, if they choose. As a student or staff member, you can support our team by coming to the next matches and cheering T.E.S.T. Team 303 on to the finals, so come by the 18th or 19th, and if you can’t make it, the next match is the Hudson Valley Regional competition (for more information, contact Mrs. Nasson)! See you there!"},{"title":"West Side Story Broadway Night","author":"Suresh Kannoth","summary":"LIGHTS, CAMERA, ACTION! The Bridgewater-Raritan High School Choir Program took on Broadway this year as it hosted Broadway Night.","article":"LIGHTS, CAMERA, ACTION! The Bridgewater-Raritan High School Choir Program took on Broadway this year as it hosted Broadway Night. This year, Broadway Night took place on February 22nd - 23rd. Broadway Night is an annual concert that provides all BRHS choir students with the opportunity to perform great music from that wonderful genre. This years’ Broadway night was centered around the musical West Side Story. Mr. Wilson, the BRHS, choir director runs the annual concert. Mr. Wilson expressed that “Even among Leonard Bernstein's impressive list of compositions, ''West Side Story'' shines as a true masterpiece. The plot is based off of the Romeo and Juliet story. Instead of Montagues and Capulets, the plot of West Side Story features two rival gangs, the Sharks and the Jets. The Sharks represent a young group of immigrants from Puerto Rico, who are reacting from intimidation from the Jets, members of the white resident community. I feel like the eventual acceptance of the 'other' and love overcoming all obstacles are timeless themes. It felt like a good programming choice for our world today.” BRHS first started to produce Broadway Night performances in 2010 in order to enhance the students’ experience in choir. In past years, BRHS has emulated The Lion King, Ragtime, Into the Woods, Newsies, and others. Every Broadway Night has featured a medley that is sung by every choir student at BRHS. But prior to the performance, students can audition for solos, duets, or even small groups to sing during the concert. Mr Wilson conveyed that he chose acts based on the strength of their performance audition. He assesses the preparation (sound knowledge and understanding of music), their vocal technique, and their ability to act and communicate an idea. But overall, Mr. Wilson maintained that Broadway Night is an important event for BRHS choir. “It provides students with an opportunity to perform repertoire that they find meaningful. It also provides them with a performing opportunity, which is highly educational!” Mr. Wilson helped to convey that this year’s West Side Story was a success with all of the students doing a wonderful job. He hopes to make many more successful choir events for the students here at BRHS. When asked about the next theme of Broadway Night, Mr. Wilson said, “This is a tough one! Boy, it would be neat to do something by Lin-Manuel Miranda!” Mr. Wilson has helped to ensure through Broadway Night that his students have fun performing a new style while also being able to create a fantastic performance using their vocal skills. Through fun events like Broadway Night, the BRHS choir stands out in bringing energy and enthusiasm to their peers."}]},{"title":"Features","content":[{"title":"BRHS STUDENTS ORGANIZE DOMESTIC ABUSE 5K RACE","author":"JOHN ANTHONY CICALE AND MAGGIE BUCKRIDGE","summary":"On Sunday, April 9, 2017, Bridgewater Raritan High School students will come together with various high schools throughout Somerset County to host the fourth annual Purple Laces 5K at Duke Island Park, Bridgewater NJ.","article":"On Sunday, April 9, 2017, Bridgewater Raritan High School students will come together with various high schools throughout Somerset County to host the fourth annual Purple Laces 5K at Duke Island Park, Bridgewater NJ. The Purple Laces Committee is made up students from numerous high schools around Somerset County including BRHS, Somerville, Hillsborough, and Watchung Hills, just to name a few. Together the committee organizes the 5K Race to raise awareness for domestic abuse and funds for Safe+Sound Somerset. Safe+Sound Somerset is a local non-profit organization that aids victims escaping abusive relationships through its safe house, transitional housing, counseling, and legal advocacy services. Theses services are essential to help victims recover from abuse and eventually resume their everyday lives. With the help of Safe+Sound Somerset, the Purple Laces Committee has been planning the event since September by recruiting businesses to sponsor it, designing t-shirts, creating an opening program, and spreading the race around the community to get runners to register. SPEAK is a club here at BRHS founded by Maggie Buckridge, John Anthony Cicale, Mark Imparato, and Shannon Stewart. In the spring, members of the club will be educating the freshman about teen dating violence. Purple Laces is made possible by SPEAK. The club has been advertising the event by hanging posters. The members volunteer at bake sales to raise, and register as donors to raise money for the cause.The students raised $5,600 at last year’s event to fund a new, strong fence around the organization’s safe house. The funds raised this year will support all of the children’s programs at Safe+Sound Somerset, including the art therapy portion of the program. These programs provide therapy to children who have witnessed and been deeply impacted by domestic abuse.The students invite you to come and join them to raise awareness in the community and funds to combat domestic abuse. Particpants can register and find out more information at https://runsignup.com/Race/NJ/BaskingRidge/PurpleLaces5KRace. This race is open to everyone and family-friendly as participants can either run or walk. The race starts at 9:00 am and runners will receive an event t-shirt, bag, power bar, and award (if they place in one of the age categories). The Purple Laces 5K is a great opportunity to join the community and fellow BRHS students in combating this detrimental issue affecting millions each day."}]}]}]}